{"commits":[{"commit":"e8b4aa3b3712b96c5f387a235d5ee023d739001f","date":"2014-08-16T02:12:52-05:00","author":"Michael Sheets","summary":"Use latest version of ruby rather than the shim","body":"This allows ruby to correctly match unicode characters when 2.0 is present. Fixes #18."},{"commit":"c0cd5ab4d3d0252684088717a089247fd94c5563","date":"2014-05-21T11:15:21-04:00","author":"Daniel Lee Harple","summary":"Allow TM_COMMENT_DISABLE_INDENT to be negated","body":"If a bundle by default set TM_COMMENT_DISABLE_INDENT to &#39;yes&#39;, then it could not be disabled through use of a .tm_properties file or by the “Variables” section in the Preferences pane."},{"commit":"73eb1a49c7340e149cc64edd2b32199c61326ffe","date":"2014-04-28T10:11:21+07:00","author":"Allan Odgaard","summary":"Strip trailing whitespace when inserting/removing comments","body":"Trailing whitespace can happen when removing comments from empty lines (with indented comment markers) or when the comment marker itself has whitespace and is inserted on an empty line (e.g. prefixing empty lone with ‘# ’)."},{"commit":"96d04b9d67aefcee0c4955c8802f775bf25e4a45","date":"2014-04-18T21:03:21+07:00","author":"Allan Odgaard","summary":"Only change indent when pressing { or } when &gt;1 line is selected","body":"The use case is code like:\n\n    if(foo)\n        statement;\n\nIf we want to add more statements (under the if block) then we need to wrap the statement in braces but don’t want the indent changed.\n\nLikewise we may be left with a single statement in the block and prefer the non-braced version."},{"commit":"69e84e16f3102da8772e9e76cf63bc30fa53b9fd","date":"2013-07-21T16:13:02+02:00","author":"Allan Odgaard","summary":"Limit amount of indent for soft wrapped line comments","body":"We now re-use the line’s indent and add at most 4 more spaces. This should avoid the bad cases with long lines causing the comment to be wrapped with a problematic small width."},{"commit":"49234241f6679d77d5e085e300cade0acd276947","date":"2013-05-09T11:16:49+07:00","author":"Allan Odgaard","summary":"Shell scripts are made executable on save","body":"Previously only ruby, perl, and python scripts (with a shebang) were made executable."},{"commit":"2436fd3aca0f84ac18d5bcf6f1c1cf1bae716db3","date":"2013-03-14T12:37:20+01:00","author":"Allan Odgaard","summary":"Typing single-quote with selection in string will wrap selection","body":"Normally we have single-quote disabled as a paired character for strings (and comments) but when there is a selection it’s more likely that the user wants to wrap the selection than replace selection with a single-quote character."},{"commit":"2c613cf1b9933283258bd5304def56058fece312","date":"2013-03-14T12:30:35+01:00","author":"Allan Odgaard","summary":"Disable indent corrections for quoted strings","body":"Previously this was only done for strings in PHP sources but it makes sense to set globally."},{"commit":"f5bb8e174581a8ba163c3df6c99bf0f1cb5890f5","date":"2013-03-13T16:06:40+01:00","author":"Allan Odgaard","summary":"Ignore block-comments when estimating indent","body":"This setting was previously found in the C bundle."},{"commit":"327c44747c64838f289e0b92dd5c4cbd1ec83384","date":"2013-02-19T13:07:14+01:00","author":"Allan Odgaard","summary":"Add backtick to chars stripped when pressing ] (with a selection)"},{"commit":"53579ed0c5295915304a4bb7ede33b851973b6b7","date":"2013-02-07T05:39:32-06:00","author":"Michael Sheets","summary":"Don&#39;t re-indent code as it is being commented in/out.","body":"When commenting or uncommenting text we want to leave the text as it is rather than indenting to the point of the first like a normal command.\n\nFixes textmate/textmate#387, however it will require a TextMate update as this flag is not currently enabled in 2.0."},{"commit":"e3c3e64fbe43f93e24a002e6aa052646525a1faa","date":"2013-02-07T05:34:32-06:00","author":"Michael Sheets","summary":"Don&#39;t enable spell checking for strings in embedded code.","body":"We enable spell checking for strings in the source scope which allows sensible spell checking. However inside of the text scope we want to not enable these when they appear in embedded source code (eg: PHP) as it is more common to want to have spell checking enabled in text files without getting it in the source portion."},{"commit":"07fc4bd926c481115b0c8c21c1e3d725e51dae1f","date":"2013-01-29T11:53:23+01:00","author":"Allan Odgaard","summary":"Disable indent auto-corrections for comment blocks","body":"Languages do not have indent patterns that handle (block) comments, so TextMate basically never does the right thing inside these.\n\nIdeally we would also disable it for the line following the block comment (since the estimated indent there is thrown off by the block comment), but that is presently not possible. Users can disable auto-corrections for the entire file scope, should they run into this a lot.\n\nCloses textmate/textmate#721."},{"commit":"9a568e782697ed8716263bd9351c0bdd972d4ee1","date":"2012-09-30T15:33:17+02:00","author":"Allan Odgaard","summary":"Update scope for wrap/unwrap actions","body":"These are now scoped so they only fire when there is a single continuous selection, as presently, they do not work for discontinuous selections."},{"commit":"15aa0965ba80f03ec18f60af3a0581d6522e7e6c","date":"2012-09-19T12:39:41+02:00","author":"Allan Odgaard","summary":"Preserve selection for large selections","body":"If selection is larger than ARG_MAX (256 KB) then TM_SELECTED_TEXT will be set to a placeholder value."},{"commit":"9c24fc22fe3c43981b570b7887dc2a2aa0286da8","date":"2012-09-19T05:13:21-05:00","author":"Michael Sheets","summary":"Only activate when the selection is continuous."},{"commit":"b8f53a952939bee7580c798dcd2b9a7b8694c44c","date":"2012-09-05T13:40:27+02:00","author":"Allan Odgaard","summary":"New “Strip Wrap Characters” action bound to ‘]’","body":"This will strip a single pair of leading/trailing braces, quotes, and similar. It also works to strip an Objective-C string: @&quot;foo&quot; → foo.\n\nThe command is only active when there is a selection.\n\nPresently no effort is done to actually ensure the stripped characters are actually balanced. It doesn’t seem like any real benefit would be derived for adding this complexity."}],"name":"Source"}